In [65]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [66]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Concepts and Technologies of AI/Titanic-Dataset.csv')
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [67]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Problem 1 - Sorting:

In [68]:
print("DataFrame with Fare only column:")
fare = titanic_df['Fare']
print(fare.head())

DataFrame with Fare only column:
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

In [69]:
print("Dataframe with Pclass and Age column:")
pclass_age = titanic_df[['Pclass', 'Age']]
print(pclass_age.head())

Dataframe with Pclass and Age column:
   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

In [70]:
print("Dataframe with Survived and Sex column:")
survived_sex = titanic_df[['Survived', 'Sex']]
print(survived_sex.head())

Dataframe with Survived and Sex column:
   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

Problem - 2 - Subsetting:

Subsetting Rows

In [71]:
print("\n1. Passengers with fare > 100:")
fare_gt_100 = titanic_df[titanic_df['Fare'] > 100]
print(fare_gt_100.head())

1. Passengers with fare > 100:
     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female   NaN      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked
27       2     19950  263.0000  C23 C25 C27        S
31       0  PC 17569  146.5208          B78        C
88       2     19950  263.0000  C23 C25 C27        S
118      1  PC 17558  247.5208      B58 B60        C
195      0  PC 17569  146.5208          B80        C

In [72]:
print("\n2. First class passengers:")
first_class = titanic_df[titanic_df['Pclass'] == 1]
print(first_class.head())

2. First class passengers:
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
23      0    113788  35.5000    A6        S

In [73]:
print("\n3. Female passengers under 18:")
female_under_18 = titanic_df[(titanic_df['Age'] < 18) & (titanic_df['Sex'] == 'female')]
print(female_under_18.head())

3. Female passengers under 18:
    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

Subsetting Rows by Categorical variables:

In [74]:
print("\n1. Passengers who embarked at C or S:")
embarked_c_or_s = titanic_df[titanic_df['Embarked'].isin(['C', 'S'])]
print(embarked_c_or_s.head())

1. Passengers who embarked at C or S:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [75]:
print("\n2. First or second class passengers:")
first_second_class = titanic_df[titanic_df['Pclass'].isin([1, 2])]
print(first_second_class.head())

2. First or second class passengers:
    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
9            10         1       2
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
9       0    237736  30.0708   NaN        C
11      0    113783  26.5500  C103        S

Exploratory Data Analysis Practice Exercise - 1.

Which passenger had the highest fare paid relative to their age?

In [76]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].median())

In [77]:
titanic_df['fare_per_year'] = titanic_df['Fare'] / titanic_df['Age']

In [78]:
high_fare_age = titanic_df[titanic_df['fare_per_year'] > 5]

In [79]:
high_fare_age_srt = high_fare_age.sort_values(by='fare_per_year', ascending=False)

In [80]:
result = high_fare_age_srt[['Name', 'fare_per_year']]
print(result.head())

                                Name  fare_per_year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000

Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their
class?

In [81]:
titanic_df['fare_per_class'] = titanic_df['Fare'] / titanic_df['Pclass']

In [82]:
adult_males = titanic_df[(titanic_df['Sex'] == "male") & (titanic_df['Age'] >= 18)]

In [83]:
adult_males_srt = adult_males.sort_values(by='fare_per_class', ascending=False)

In [84]:
result = adult_males_srt[['Name', 'Age', 'fare_per_class']]
print(result.head())

                                   Name   Age  fare_per_class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
27       Fortune, Mr. Charles Alexander  19.0        263.0000
438                   Fortune, Mr. Mark  64.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208

3.3 Exploratory Data Analysis with Group-by Method Practice Exercise:

What percent of the total fare revenue came from each passenger class?

In [85]:
total_fare = titanic_df['Fare'].sum()

In [86]:
fare_pclass_1 = titanic_df[titanic_df['Pclass']==1]['Fare'].sum()

In [87]:
fare_pclass_2 = titanic_df[titanic_df['Pclass']==2]['Fare'].sum()

In [88]:
fare_pclass_3 = titanic_df[titanic_df['Pclass']==3]['Fare'].sum()

In [89]:
proportion = [fare_pclass_1/total_fare, fare_pclass_2/total_fare, fare_pclass_3/total_fare]

In [90]:
print(proportion)

[np.float64(0.6334928771899656), np.float64(0.1324962855496507), np.float64(0.23401083726038366)]

What percent of the total number of passengers on the Titanic belonged to each age group
(e.g., child, adult, senior)?

In [91]:
def age_group(age):
    if age < 18:
        return "child"
    elif age < 65:
        return "adult"
    else:
        return "senior"

In [92]:
titanic_df['age_group'] = titanic_df['Age'].apply(age_group)

In [93]:
total_passenger = len(titanic_df)

In [94]:
group = titanic_df['age_group'].value_counts()

In [95]:
percentage = (group / total_passenger) * 100

In [96]:
print(percentage)

age_group
adult     86.083053
child     12.682379
senior     1.234568
Name: count, dtype: float64